In [18]:
#1
#Print elements from odd positions from the list
sample_list = [5,7,23,16,8]
#Expected output: 7, 16
sample_list

[5, 7, 23, 16, 8]

In [124]:
sample_list[1::2]

[7, 16]

In [24]:
mylist = []
i = 0
while len(sample_list) > i:
    for x in sample_list:
        num = sample_list.index(x)
        if num % 2 != 0:
            mylist.append(x)
        i += 1

mylist

[7, 16]

In [119]:
#2
#Find the most frequent value in a list in 2 ways
a = [3, 1, 2, 2, 3, 3, 4, 5, 6, 3]
#Expected Output: 3

a.count(3)

4

In [99]:
#solution #1

dict = {}
for x in set(a):
    dict.update({f'{x}': (a.count(x))})


number = [(value, key) for key, value in dict.items()]
print(max(number)[1])

3

In [120]:
max(a, key=a.count)

3

In [123]:
import pandas as pd

df = pd.DataFrame(a)

df.mode()

   0
0  3

In [ ]:
#3
#Write a function that checks if a string consists of only unique characters(case insensitive)

#Sample input: Hello
#Expected output: False

In [38]:
def checker(x):
    lst = []
    for i in x:
        lst.append(i)
    if len(lst) == len(set(lst)):
        return True
    else:
        return False

In [41]:
checker('Hello')

False

In [108]:
#4 Return average salary in each department. Write a query in sql and in pandas

import pandas as pd

data = {
    'id': [1, 2, 3, 4, 5],
    'name': ['Manny', 'Bek', 'Charlie', 'Carlo', 'Davide'],
    'department': ['Engineering', 'Sales', 'Engineering', 'HR', 'Sales'],
    'salary': [70000, 60000, 80000, 50000, 70000]
}

df = pd.DataFrame(data)

In [8]:
(df.groupby('department').agg(avg_salary = pd.NamedAgg(column='salary',aggfunc='mean')))

             avg_salary
department
Engineering     75000.0
HR              50000.0
Sales           65000.0

In [42]:
df

   id     name   department  salary
0   1    Manny  Engineering   70000
1   2      Bek        Sales   60000
2   3  Charlie  Engineering   80000
3   4    Carlo           HR   50000
4   5   Davide        Sales   70000

In [43]:
command = '''select department, avg(salary)
            group by department
    '''

In [ ]:
#5. Using the dataframe above, return people who get more 
#than the average salary in their department
#You should write the code both in SQL, and in Pandas

In [46]:
df

   id     name   department  salary
0   1    Manny  Engineering   70000
1   2      Bek        Sales   60000
2   3  Charlie  Engineering   80000
3   4    Carlo           HR   50000
4   5   Davide        Sales   70000

In [51]:
avg_df = (df.groupby('department').agg(avg_salary = pd.NamedAgg(column='salary',aggfunc='mean'))).reset_index()
avg_df

    department  avg_salary
0  Engineering     75000.0
1           HR     50000.0
2        Sales     65000.0

In [117]:
avg = df.groupby(['department'])['salary'].agg('mean').reset_index()
merged = df.merge(avg,on='department')

df[merged['salary_x'] > merged['salary_y']]

   id     name   department  salary
2   3  Charlie  Engineering   80000
4   5   Davide        Sales   70000

In [53]:
'''
select * from df 
where salary > (select avg(salary) from df group by department)

'''

'\nselect * from df \nwhere salary > (select avg(salary) from df group by department)\n\n'

In [143]:
def abbrev_name(name):
    string = name.split()
    last = string[0][0].upper()
    first = string[1][0].upper()
    return f'{last}.{first}'

abbrev_name('Sardor ismatov')

'S.I'

In [145]:
83 // 2

41

In [ ]:
n = 100
while n > 1:
    print(n)
    n /= 2  # Reduces n by dividing it by 2 each time

In [165]:
numbers = [5, 6, 8, 9, 10]   # Missing number is 3

def finder(x):
    x.sort()
    return sum(range(x[0],x[-1]+1)) - sum(x)

finder(numbers)

7

In [163]:
def finder(x):
    n = max(x)  # Find the maximum number (assuming 1 to N range)
    expected_sum = n * (n + 1) // 2
    actual_sum = sum(x)
    return expected_sum - actual_sum

numbers = [5, 6, 8, 9, 10]  
print(finder(numbers))  # Output: 3

17

In [166]:
numbers = [4, 3, 2, 4, 1, 3, 2]

print(min(numbers,key=numbers.count))

1

In [ ]:
# 18 
# 21 
# 6 * 7 / 2

In [190]:
string = "aeeccarss"
def uniqer(x):
    # lst = []
    # for i in x:
    #     lst.append(i)
    for a in x:
        if x.count(a) == 1:
            print(a)
            break
    else:
        return 'Unique char not found'

uniqer(string)

r

In [201]:
Input = [9, 1, 4, 7, 3, 2, 8, 5, 6]
#Output: 9  # The longest sequence is [1, 2, 3, 4, 5, 6, 7, 8, 9]

def function(x):
    x = sorted(set(x))
    x = list(x)
    i = 0
    while i < len(x)-1:
        
        ct = 0
        while x[i] == x[i+1]:
            ct += 1
        
        i += 1
    print(ct)

function(Input)

0

In [ ]:
def createDataframe(student_data: List[List[int]]) -> pd.DataFrame:
    return pd.DataFrame(student_data,columns=['student_id','age'])

In [204]:
student_data = [
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]

In [205]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)

# Getting the number of rows and columns
rows = df.shape
rows

(3, 3)

In [ ]:

def createBonusColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['bonus'] = employees['salary']*2
    employees.drop_duplicates()
    employees.fillna('quantity': 0 )
    pd.concat()
    employees.sor

In [214]:
word1 = "abc"
word2 = "pqr"

In [ ]:
class Solution:
    def mergeAlternately(self, word1: str, word2: str) -> str:
        i = 0
        result = []
        while len(word1) > i or len(word2) > i:
            if len(word1) > i:
                result.append(word1[i])
            if len(word2) > i:
                result.append(word2[i])
        print(result)

In [216]:
word = "  hello world  "

In [227]:
def reverser(s):
    s = s.split()[::-1]
    return " ".join(s)

reverser(word)

'world hello'